{
    "endReached":"Вы достигли конца этого раздела!",
    "continueToNext":"Перейти к следующему разделу:",
    "rememberToCheckPoints":"Вы можете проверить свои текущие баллы, нажав на синий кружок в правом нижнем углу страницы.",
    "footer-src":"Исходный код материала",
    "footer-edit-page":"Редактировать страницу",
    "footer-report-issue":"Сообщить об ошибке",
    "makers":"Этот курс создан группой Agile Education Research",
    "rage":"Университета Хельсинки",
    "credits":"О материале и его создателях",
    "twitter-aria":"Twitter профиль Mooc.fi",
    "facebook-aria":"Facebook профиль Mooc.fi",
    "yourube-aria":"YouTube канал Mooc.fi",
    "logout":"Выйти",
    "newAccount":"Создать новую учетную запись",
    "login":"Войти",
    "mailingListTitle":"Напомнить мне, когда курс начнется",
    "subscribe":"подписаться",
    "tableOfContents":"Оглавление",
    "sampleOutput":"Пример вывода",
    "sampleData":"Примеры данных",
    "loginToSeeExercise":"Войдите, чтобы увидеть упражнение",
    "loginToAttemptExercise":"Войдите, чтобы выполнить упражнение.",
    "pleaseLogin":"Вы не вошли в систему. Некоторые части материала доступны только для авторизованных пользователей. Вы можете войти здесь: ",
    "inThisSection":"В этой части:" ,
    "programmingExercise":"Упражнение по программированию:",
    "moodleExercise": "Упражнение Moodle:",
    "sqlTrainerExercise": "Упражнение SQL trainer:",
    "points":"Баллы",
    "submitNB":"Примечание: В некоторых упражнениях есть несколько частей, и вы можете получить баллы за разные части отдельно. Вы можете отправить частично выполненное упражнение, выбрав 'Submit Solution' в меню рядом с кнопкой выполнения тестов",
    "installationGuideLink":"",
    "submitHowTo":"",
    "loginForExercise":"Войдите, чтобы увидеть упражнение",
    "loginToSeeExercisePoints": "Войдите, чтобы увидеть баллы за упражнение.",
    "submitNetBeans":"Отправьте ваше решение для проверки на сервере в среде программирования NetBeans: ",
    "seeSubmissions":"Вы можете посмотреть свои отправки в среде отправки упражнений Test My Code.",
    "here":"здесь",
    "solutionHowTo":"Как посмотреть решение",
    "coinSolutionHowTo":"Как посмотреть решение до выполнения упражнения",
    "noCoin":"В этом упражнении вы не можете использовать монету для просмотра решения до отправки упражнения.",
    "noCoinsOnCourse": "На этом курсе вы не можете просматривать решение до выполнения упражнения.",
    "modelSolutionUnavailableBecauseEmailNotVerified": "Пожалуйста, подтвердите свой адрес электронной почты, чтобы включить решения.",
    "whyCoin":"Вы можете увидеть решение до или после отправки упражнения. Если вы хотите увидеть решение до отправки упражнения, вам нужно использовать монеты решений.",
    "coinCost": "Одно решение стоит столько же монет, сколько баллов стоит упражнение.",
    "usesCoinMultiplePoints": "стоимость:",
    "usesCoinMultiplePoints2": "монет",
    "getNewCoin":"Вы получите новую монету решения, когда отправите",
    "getNewCoin2":"упражнений. Вы можете использовать монеты, чтобы увидеть решения упражнений и выйти из затруднительного положения.",
    "oneCoin":"У вас есть 1 монета",
    "howManyCoins":"У вас есть <1>{{count}}</1> монет.",
    "nocoins":"У вас пока нет монет.",
    "howCoins":"Вы используете монету только когда нажимаете кнопку 'Использует монету' под этим текстом. Вы можете увидеть решение без использования монеты в сервисе Test My Code либо в Netbeans, либо на сайте TMC после выполнения и отправки соответствующего упражнения.",
    "howSeeSolution":"Вы можете увидеть решение в сервисе Test My Code либо в TMCBeans, либо на сайте TMC после выполнения соответствующего упражнения.",
    "seeSolution":"Посмотреть решение",
    "usesCoin":"Использует монету",
    "coinUsed":"Вы уже использовали монету для этого решения",
    "update":"Обновить",
    "solution":"Решение",
    "exerciseList":"Список упражнений в этой части",
    "unknownType":"Неизвестный тип упражнения",
    "quiz":"Тест",
    "loading":"Загрузка раздела курса...",
    "loginToSee":"Здесь есть контент, который доступен только авторизованным пользователям. Войдите, чтобы увидеть содержимое.",
    "errorInMaterial":"Не удается загрузить этот раздел материала из-за ошибки: ",
    "incorrectMaterial":"Здесь есть некорректно определенный контент. Причина: отсутствует id.",
    "loggedInWith":"Вы вошли как: ",
    "studentInfo":"Информация о студенте",
    "aboutYourself":"Расскажите о себе. Эта информация поможет нам регистрировать зачеты курса и организовывать курс. Вы можете изменить свою информацию позже в настройках курса. После заполнения информации нажмите 'Сохранить' внизу страницы.",
    "firstName":"Имя",
    "lastName":"Фамилия",
    "sid":"Студенческий номер Университета Хельсинки",
    "nosid":"Оставьте пустым, если вы не являетесь студентом Университета Хельсинки в настоящее время.",
    "marketing":"Вы можете присылать мне информацию о новых курсах",
    "courseInfo": "Информация о курсе",
    "useCourseVariantLabel": "Я участвую в другом курсе, а не в открытом курсе mooc.fi или курсе Университета Хельсинки.",
    "courseVariant": "Организатор курса",
    "chooseCourse": "Выберите курс",
    "researchTitle":"Исследовательские темы на этом курсе",
    "research1":"Данные этого курса используются для изучения обучения. Это исследование имеет несколько целей: ",
    "research2":"Создать адаптивные учебные материалы, которые учитывают различия между студентами и при необходимости предоставляют более индивидуализированные учебные материалы.",
    "research3":"Расширить наши знания об обучении в цифровой среде.",
    "research4":"Поддержать другие стороны, работающие с учебными материалами и исследованиями в области обучения. Это естественным образом приведет к лучшим результатам обучения для студентов. ",
    "research5":"Если вас интересуют исследования в области аналитики обучения, вы можете узнать больше из статьи ",
    "research6":"Исследовательские данные этого курса управляются Матти Луукайненом из группы Agile Education Research факультета компьютерных наук Университета Хельсинки. Вы можете запросить удаление любых собранных о вас данных в любое время, отправив электронное письмо на адрес mooc@cs.helsinki.fi",
    "research7":"Данные, собранные на этом курсе, используются в исследованиях. Собранные данные содержат информацию об использовании материала, процессе выполнения упражнений и данные, собранные на экзаменах. Если какие-либо исследования данных будут опубликованы, отдельный студент не может быть идентифицирован по результатам. Отказ от участия в исследовании не имеет негативных последствий для участника курса.",
    "researchAgree":"Участие в исследовании",
    "researchYes":"Я буду участвовать в исследовании. Выбирая эту опцию, вы помогаете нынешним и будущим студентам.",
    "researchNo":"Я не буду участвовать в исследовании.",
    "save":"Сохранить",
    "fillRequired":"Пожалуйста, заполните обязательные поля.",
    "reportIssueTitle":"Как сообщить об ошибке в материале",
    "reportIssueButtonText":"Создать новый отчет об ошибке",
    "reportIssueSecondHeader":"Как составить отчет об ошибке",
    "reportIssue1":"Вы можете сообщить об обнаруженной ошибке на вкладке issues проекта курса на Github. Github - это сервис, где можно управлять проектами, программным обеспечением и исходным кодом и делиться ими с другими.",
    "reportIssue2":"Для сообщения об ошибке требуется учетная запись Github. Если у вас еще нет учетной записи, вы можете создать ее",
    "reportIssue3":"здесь",
    "reportIssue4":"Перед открытием нового отчета об ошибке, пожалуйста, проверьте",
    "reportIssue5":"не открыт ли уже отчет об обнаруженной вами ошибке.",
    "reportIssue6":"Мы можем задать уточняющие вопросы, если не сможем исправить проблему без вашей помощи. Github должен отправить уведомление по электронной почте об этих вопросах на адрес электронной почты, связанный с вашей учетной записью Github.",
    "reportIssue7":"Спасибо за помощь в улучшении наших материалов!",
    "reportIssueList1":"Нажмите кнопку выше.",
    "reportIssueList2":"Пожалуйста, включите короткий и информативный заголовок в ваш отчет об ошибке, например \"Опечатка в Части 1 в описании упражнения 30\".",
    "reportIssueList3":"Напишите более подробное описание проблемы в разделе комментариев, например \"В упражнении 30 Части 1, пример вывода содержит опечатку. Предыдущий код включает строку System.out.println(\"Введите число\");, но в примере вывода написано \"Выйдите число\"\".",
    "reportIssueList4":"Наконец, нажмите зеленую кнопку \"Submit new issue\".",
    "editPageTitle":"Как предложить изменение в материале",
    "editPageButtonText":"Редактировать страницу ",
    "editPageSecondHeader":"Как отправить предложение по изменению",
    "editPage1":"Вы можете отправить предложение по изменению в проект курса на Github. Github - это сервис, где можно управлять проектами, программным обеспечением и исходным кодом и делиться ими с другими.",
    "editPage2":"Отправка предложения по изменению требует учетной записи Github. Если у вас еще нет учетной записи, вы можете создать ее",
    "editPage3":"здесь",
    "editPage4":"Перед отправкой вашего предложения, пожалуйста, проверьте",
    "editPage5":"не предложил ли кто-то уже такое же изменение материала.",
    "editPage6":"Спасибо за помощь в улучшении наших материалов!",
    "editPageList1":"Нажмите кнопку выше, чтобы редактировать страницу, на которой вы только что были.",
    "editPageList2":"Переключите стиль переноса с \"No wrap\" --> \"Soft wrap\" в правом верхнем углу окна редактирования.",
    "editPageList3":"Найдите раздел в материале, который вы хотите изменить. Вы можете искать нужный раздел, нажав Ctrl+f и введя подходящий поисковый запрос.",
    "editPageList4":"Прокрутите вниз страницы и напишите короткий и информативный заголовок в поле \"Propose file change\", например \"Исправление опечатки в Части 2\".",
    "editPageList5":"нажмите зеленую кнопку \"Propose file change\". Это должно перенаправить вас на другую страницу.",
    "editPageList6":"На перенаправленной странице нажмите кнопку \"New Pull Request\".",
    "difficultyHeader": "Сложность: -",
    "difficultyHeader1": "Сложность: Легкая",
    "difficultyHeader2": "Сложность: Средняя",
    "difficultyHeader3": "Сложность: Сложная"
}